---
kind: property
id: P:Autodesk.Revit.DB.Architecture.SiteSubRegion.TopographySurface
source: html/a6e38474-7fe8-4c4a-e138-96dca3391ae9.htm
---
# Autodesk.Revit.DB.Architecture.SiteSubRegion.TopographySurface Property

The TopographySurface element which this SiteSubRegion represents.

## Syntax (C#)
```csharp
public TopographySurface TopographySurface { get; }
```